app/controllers/imports_controller.rb

SELECT * FROM "imports"
---
  def index
    @imports = Import.all

SELECT * FROM "imports" WHERE ("imports"."id" = 5)
---
  def show
    @import = Import.find(params[:id])

INSERT INTO "imports" ("created_at", "updated_at", "filename") VALUES('2010-05-25 07:52:53', '2010-05-25 07:52:53', '--- !ruby/object:File
INSERT INTO "log_entries" ("referral_id", "referral_year", "created_at", "import_id", "updated_at", "logged_at", "signed_by", "additional_info", "referral_type", "event_type") VALUES(NULL, NULL, '2010-05-25 08:23:18', NULL, '2010-05-25 08:23:18', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @import = Import.new(params[:import])
    saving_import_succeeded = @import.save

    if saving_import_succeeded
      @parsed_file = CSV::Reader.parse(params[:import][:filename], ';')
      #logger.info("---Started importing.")
      n = 0
      @parsed_file.each do |row|
        unless n == 0 # Skip first row with headers in CSV.
          le = LogEntry.new
          le.event_type = row[0]
          le.additional_info = row[1]
          le.logged_at = DateTime.parse(row[2].gsub('.', ':'))
          le.signed_by = row[3]
          le.referral_type = row[4]
          le.referral_id = row[5]
          le.referral_year = row[6]
          le.import_id = @import.id
          #le.save

          et = EventType.find_or_initialize_by_code(le.event_type)
          if et.new_record?
            et.code = le.event_type # Really necessary?
            et.save
          end
          le.event_type_id = et.id
          le.save