app/controllers/log_entries_controller.rb

  def index
    @log_entries = LogEntry.all
---
SELECT * FROM "log_entries"